templates/order-status/version-1-0-0/get-order-status-types.xml

<?xml version='1.0' encoding='utf-8'?>
<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
    <soap-env:Body>
        <ns0:GetOrderStatusTypesRequest xmlns:ns0="http://www.promostandards.org/WSDL/OrderStatusService/1.0.0/">
            <ns0:wsVersion>{{wsVersion}}</ns0:wsVersion>
            <ns0:id>{{username}}</ns0:id>
            <ns0:password>{{password}}</ns0:password>
        </ns0:GetOrderStatusTypesRequest>
    </soap-env:Body>
</soap-env:Envelope>
